[Killed] BlockStatement
src/cost.mjs:9:41
  *   model id → USD per million input / output tokens.
  * @returns {number|null} cost in USD, or null when the model is absent from pricing.
  */
-export function costUsd(usage, pricing) {
-  const rate = pricing[usage.model];
-  if (!rate) return null;
-  const tokensIn = usage.tokens_in ?? 0;
-  const tokensOut = usage.tokens_out ?? 0;
-  return (tokensIn * rate.in + tokensOut * rate.out) / 1_000_000;
-}
+export function costUsd(usage, pricing) {}
 
killedBy: All tests
statusReason: ✖ costUsd charges input-only usage at the pricing rate (1.889143ms)
✖ costUsd sums input and output cost (0.303453ms)
✖ costUsd returns null when the model is absent from pricing (0.298298ms)
✖ costUsd treats missing token counts as zero (0.196875ms)

ℹ tests 4
ℹ suites 0
ℹ pass 0

[Killed] BooleanLiteral
src/cost.mjs:11:7
  */
 export function costUsd(usage, pricing) {
   const rate = pricing[usage.model];
-  if (!rate) return null;
+  if (rate) return null;
   const tokensIn = usage.tokens_in ?? 0;
   const tokensOut = usage.tokens_out ?? 0;
killedBy: All tests
statusReason: ✖ costUsd charges input-only usage at the pricing rate (1.738084ms)
✖ costUsd sums input and output cost (0.300077ms)

✖ costUsd returns null when the model is absent from pricing (0.202052ms)

✖ costUsd treats missing token counts as zero (0.245641ms)

ℹ tests 4

[Killed] ConditionalExpression
src/cost.mjs:11:7
  */
 export function costUsd(usage, pricing) {
   const rate = pricing[usage.model];
-  if (!rate) return null;
+  if (true) return null;
   const tokensIn = usage.tokens_in ?? 0;
   const tokensOut = usage.tokens_out ?? 0;
killedBy: All tests
statusReason: ✖ costUsd charges input-only usage at the pricing rate (2.505588ms)

✖ costUsd sums input and output cost (0.338438ms)

✔ costUsd returns null when the model is absent from pricing (0.328487ms)

✖ costUsd treats missing token counts as zero (0.406489ms)

[Killed] LogicalOperator
src/cost.mjs:12:20
 export function costUsd(usage, pricing) {
   const rate = pricing[usage.model];
   if (!rate) return null;
-  const tokensIn = usage.tokens_in ?? 0;
+  const tokensIn = usage.tokens_in && 0;
   const tokensOut = usage.tokens_out ?? 0;
   return (tokensIn * rate.in + tokensOut * rate.out) / 1_000_000;
killedBy: All tests
statusReason: ✖ costUsd charges input-only usage at the pricing rate (1.806645ms)
✖ costUsd sums input and output cost (0.348784ms)
✔ costUsd returns null when the model is absent from pricing (0.208565ms)
✖ costUsd treats missing token counts as zero (0.245237ms)

ℹ tests 4
ℹ suites 0
ℹ pass 1

[Killed] LogicalOperator
src/cost.mjs:13:21
   const rate = pricing[usage.model];
   if (!rate) return null;
   const tokensIn = usage.tokens_in ?? 0;
-  const tokensOut = usage.tokens_out ?? 0;
+  const tokensOut = usage.tokens_out && 0;
   return (tokensIn * rate.in + tokensOut * rate.out) / 1_000_000;
 }
killedBy: All tests
statusReason: ✔ costUsd charges input-only usage at the pricing rate (1.137697ms)

✖ costUsd sums input and output cost (0.926649ms)
✔ costUsd returns null when the model is absent from pricing (0.15703ms)
✖ costUsd treats missing token counts as zero (0.265095ms)

ℹ tests 4
ℹ suites 0

[Killed] ArithmeticOperator
src/cost.mjs:14:11
   if (!rate) return null;
   const tokensIn = usage.tokens_in ?? 0;
   const tokensOut = usage.tokens_out ?? 0;
-  return (tokensIn * rate.in + tokensOut * rate.out) / 1_000_000;
+  return (tokensIn * rate.in - tokensOut * rate.out) / 1_000_000;
 }
 
killedBy: All tests
statusReason: ✔ costUsd charges input-only usage at the pricing rate (1.121731ms)

✖ costUsd sums input and output cost (0.9497ms)

✔ costUsd returns null when the model is absent from pricing (0.155037ms)
✔ costUsd treats missing token counts as zero (0.152013ms)

ℹ tests 4

[Killed] ArithmeticOperator
src/cost.mjs:14:32
   if (!rate) return null;
   const tokensIn = usage.tokens_in ?? 0;
   const tokensOut = usage.tokens_out ?? 0;
-  return (tokensIn * rate.in + tokensOut * rate.out) / 1_000_000;
+  return (tokensIn * rate.in + tokensOut / rate.out) / 1_000_000;
 }
 
killedBy: All tests
statusReason: ✔ costUsd charges input-only usage at the pricing rate (1.139249ms)

✖ costUsd sums input and output cost (0.987586ms)

✔ costUsd returns null when the model is absent from pricing (0.188359ms)
✔ costUsd treats missing token counts as zero (0.171802ms)

ℹ tests 4
